app/Http/Controllers/CategoriesController.php

select * from `categories` where `categories`.`id` in ('2')
select * from `comments` where `comments`.`post_id` in ('1')
select * from `images` where `images`.`id` in ('1')
select * from `posts` limit 2 offset 0
select * from `categories` limit 10 offset 0
select * from `posts` where `posts`.`category_id` in ('1', '2', '3')
select count(*) as aggregate from `categories`
select count(*) as aggregate from `posts` where `category_id` = '1'
---
    public function listArticleByCategory($id){
        $articles = Post::with(['comments','user','image','category','competences'])->paginate(2);
        $categories = Category::with(['posts'])->paginate(10);
        $listeArticles = Post::with('user','comments')->where('category_id', $id)->paginate(10);