app/Http/Controllers/FrontController.php

select * from `categories` where `categories`.`id` in ('2')
select * from `comments` where `comments`.`post_id` in ('1')
select * from `images` where `images`.`id` in ('1')
select * from `posts` limit 4 offset 0
---
    public function index(){
        $articles = Post::with(['comments','user','image','category','competences'])->paginate(4);