app/Http/Controllers/PostController.php

select * from `categories` where `categories`.`id` in ('2')
select * from `comments` where `comments`.`post_id` in ('1')
select * from `images` where `images`.`id` in ('1')
select * from `posts` limit 2 offset 0
select * from `categories` limit 10 offset 0
select * from `posts` where `posts`.`category_id` in ('1', '2', '3')
select count(*) as aggregate from `categories`
select * from `posts` where `slug` = 'bF27QUxV1pd52klW' limit 1
select * from `users` where `users`.`id` in ('2')
---
    public function show($slug){
        $articles = Post::with(['comments','user','image','category','competences'])->paginate(2);
        $categories = Category::with(['posts'])->paginate(10);
        $article = Post::with('user','comments')->where('slug', $slug)->firstOrFail();